; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared2 - mode
	spectrograph0 - mode
	image3 - mode
	image1 - mode
	GroundStation10 - direction
	GroundStation11 - direction
	GroundStation0 - direction
	Star7 - direction
	Star9 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	Star14 - direction
	Star2 - direction
	Star1 - direction
	Star12 - direction
	GroundStation13 - direction
	GroundStation3 - direction
	GroundStation6 - direction
	GroundStation8 - direction
	Planet15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 Star9)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star12)
	(calibration_target instrument0 Star7)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 Star7)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 GroundStation13)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon17)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation5)
	(supports instrument3 spectrograph0)
	(supports instrument3 image1)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 Star9)
	(calibration_target instrument3 Star1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star18)
	(supports instrument4 image1)
	(supports instrument4 image3)
	(supports instrument4 infrared2)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star12)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star14)
	(supports instrument5 image1)
	(supports instrument5 infrared2)
	(supports instrument5 image3)
	(calibration_target instrument5 Star12)
	(calibration_target instrument5 Star1)
	(supports instrument6 infrared2)
	(supports instrument6 spectrograph0)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 GroundStation3)
	(calibration_target instrument6 GroundStation13)
	(calibration_target instrument6 Star12)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation0)
)
(:goal (and
	(pointing satellite0 Star7)
	(pointing satellite1 Star9)
	(pointing satellite2 Planet15)
	(have_image Planet15 image3)
	(have_image Star16 spectrograph0)
	(have_image Phenomenon17 spectrograph0)
	(have_image Star18 image1)
	(have_image Planet19 image1)
))

)

; plan
1. (turn_to satellite2 groundstation3 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 groundstation3)
   goals met: 0 of 8
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 8
3. (calibrate satellite2 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 0 of 8
4. (turn_to satellite2 planet15 groundstation3)
   deleted: (pointing satellite2 groundstation3)
   added: (pointing satellite2 planet15)
   goals met: 1 of 8
5. (turn_to satellite1 star9 star18)
   deleted: (pointing satellite1 star18)
   added: (pointing satellite1 star9)
   goals met: 2 of 8
6. (turn_to satellite0 groundstation0 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 8
7. (take_image satellite2 planet15 instrument4 image3)
   added: (have_image planet15 image3)
   goals met: 3 of 8
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 8
9. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon17 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 phenomenon17)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon17 instrument0 spectrograph0)
   added: (have_image phenomenon17 spectrograph0)
   goals met: 4 of 8
12. (turn_to satellite0 planet19 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 planet19)
   goals met: 4 of 8
13. (take_image satellite0 planet19 instrument0 image1)
   added: (have_image planet19 image1)
   goals met: 5 of 8
14. (turn_to satellite0 star16 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 star16)
   goals met: 5 of 8
15. (take_image satellite0 star16 instrument0 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 6 of 8
16. (turn_to satellite0 star18 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star18)
   goals met: 6 of 8
17. (take_image satellite0 star18 instrument0 image1)
   added: (have_image star18 image1)
   goals met: 7 of 8
18. (turn_to satellite0 star7 star18)
   deleted: (pointing satellite0 star18)
   added: (pointing satellite0 star7)
   goals met: 8 of 8
